FactoryBot.define do
  # like オブジェクトのテストデータを生成するための設定
  factory :like do
    post
    user
  end
end

=begin
@          @@          @@          @@          @@          @@          @@          @@          @
1
テストデータを生成するための FactoryBot ファクトリを定義
このファクトリ定義では、`like` オブジェクトのテストデータを生成するための設定が行われています。
- `factory :like` ブロック
`like` オブジェクトのファクトリを定義しています。これにより、テストで使う偽の「いいね」データを簡単に生成できます。
- `post` と `user`
`post` と `user` という名前の関連するファクトリを呼び出しています。これにより、`like` オブジェクトに関連付けら
れる `post` と `user` のテストデータが自動的に生成されます。
このファクトリを使用することで、テスト中で `like` オブジェクトを簡単に作成し、関連する `post` と `user` オブジ
ェクトも同時に生成できます。
=end
