# ================================================================================================
# SSM "aws_ecr_repository"
# ================================================================================================

# 1.1
resource "aws_ssm_parameter" "ssm_parameter" {
  # 1.2
  data_type   = "text"
  description = "portfolio_asm_rails_master_key"
  name        = "portfolio_asm_rails_master_key"
  tags        = {}
  tags_all    = {}
  tier        = "Standard"
  # 1.3
  type = "String"
  # terraform/terraform.tfvarsより取得
  value = var.rails_master_key
}

/*
@          @@          @@          @@          @@          @@          @@          @@          @
1.1
. **AWS Systems Manager の説明:**.
- AWS Systems Managerは、AWSクラウドサービスやリソースを管理するためのスイスアーミーナイフのようなものだと考え
てください。クラウド環境を効率的に管理するためのツールボックス。何が実行されているかを確認したり、問題を修正したり、
すべてが安全であることを確認したりすることができます。
- 利用シーン:オンラインストアを運営する中小企業、お店のウェブサイトと顧客データベースはAWS上でホストされています。
忙しいセールスの日、ウェブサイトが遅いことに気づき、原因を突き止める必要があります。システムの各部分を1つずつチェッ
クする代わりに、AWS Systems Managerを使います。AWS Systems Managerを使えば、すべてのAWSリソースのダッシュボ
ードを素早く見ることができ、どの部分が速度低下の原因になっているのかを突き止め、修正することができる。また、ウェブサ
イトを安全に保つためのアップデートを手動で行うことなく自動的に適用することもできます。
------------------------------------------------------------------------------------------------
. **AWS Systems Manager のパラメータストアについて説明する。
- Parameter Store は AWS Systems Manager 内の機能で、金庫のような役割を果たします。パスワード、データベースの
文字列、設定など、アプリケーションやサービスが機能するために必要な重要な情報を安全に保存します。
- 利用シーン:例えば、あなたのオンラインストアにすべての商品情報が保存されているデータベースがあるとします。このデータ
ベースにアクセスするために、バックエンドシステムは正しいパスワードを必要とします。この機密性の高いパスワードをコード
に直接保存する代わりに（権限のない人に見られると危険です）、パラメータ・ストアに保存します。システムがデータベースに
アクセスする必要があるとき、パラメータストアにパスワードを要求します。この方法ではパスワードの安全性が保たれ、特に変
更する必要がある場合にパスワードの管理が容易になります。パスワードが変更された場合は、パラメータ・ストアでパスワード
を更新するだけで、システムのすべての部分でコードを変更することなく新しいパスワードが使用されます。
------------------------------------------------------------------------------------------------
terraform import aws_ssm_parameter.<name> <パラメーター名>
実際の例：
terraform import aws_ssm_parameter.ssm_parameter portfolio_asm_rails_master_key
------------------------------------------------------------------------------------------------
aws_ssm_parameterでの略語はssmです。AWS Systems Managerは以前は「Simple Systems Manager（SSM）」と呼ば
れていました。

================================================================================================
1.2
- data_type。これは AWS SSM Parameter Store の比較的新しい属性で、パラメータに格納されるデータの種類をさらに
分類するために導入された。`data_type = "text"` は保存されるデータがプレーンテキストであることを意味します。
================================================================================================
1.3
- type`**： このパラメータは、AWS Systems Manager (SSM) Parameter Store に保存するパラメータのタイプを指
定します。AWS SSM は `String`、`StringList`、`SecureString` など、いくつかのタイプのパラメータをサポートし
ています。String`は単純なテキストを表す。
- `type` はパラメータの基本的な保存形式を定義するために使用され、`data_type` は保存されるデータの性質に関する追
加のコンテキストを与える。
*/