# 1

# 2
module ControllerMacros
  def login_user(user = FactoryBot.create(:user))
    @request.env['devise.mapping'] = Devise.mappings[:user]
    sign_in user
  end
end

# 1
=begin
@          @@          @@          @@          @@          @@          @@          @@          @
1
spec/supportディレクトリを作成することで、RSpecの設定、共通処理、共通テストデータの作成などをまとめることができ
ます。
------------------------------------------------------------------------------------------------
controller_macros.rbと命名された理由は、このファイルには、コントローラーのテストに必要なDeviseのテスト用のメ
ソッドが定義されているためです。このファイルの作成意図は、Deviseのコントローラーテストを簡単にするために、共通処
理をまとめて定義することです。また、この方法は一般的です。

================================================================================================
2
login_userメソッドを自作
(user = FactoryBot.create(:user))
FactoryBotで生成されたuserを引数に設定

------------------------------------------------------------------------------------------------
@request.env
Railsアプリケーションに対するHTTPリクエストに関する情報を保持するための、ActionDispatch::Requestオブジェクト
のインスタンス変数です。Railsアプリケーションのコントローラーでリクエストの情報を格納しているオブジェクトです。

@requestはRSpecのコントローラスペックで、リクエストのテストを実行するために使用されます。具体的には、ログインや
ログアウトのようなDeviseの機能をテストするために使用されることがよくあります。
@request.envプロパティは値にハッシュを持ちます。
@request.envプロパティのハッシュのキー['devise.mapping']に、Devise.mappings[:user]の値を設定。

------------------------------------------------------------------------------------------------
Devise.mappings[:user]
mappingsは、Deviseによって定義されたコントローラーやビューのマッピング情報を保持しているプロパティでハッシュです。
Devise.mappings[:user]は、:userというキーに対応するDeviseのマッピング設定を取得しています。これにより、
DeviseがUserモデルに対してどのような設定や動作をするかを判断できます。

------------------------------------------------------------------------------------------------
マッピング情報とは、Deviseが認証に関連する各機能を提供するために、モデルとコントローラー、ビュー、ルートなどの関連
設定を管理するための情報です。具体的には以下のような情報が含まれます。

対象のモデル: Deviseがどのモデルに対して認証機能を提供するか。
利用するモジュール: モデルにどのような認証機能（例：パスワードリセット、アカウント確認など）を追加するか。
コントローラー: 各機能に対応するコントローラーを指定することができます。これにより、デフォルトのコントローラーをカ
スタマイズしたものに置き換えることができます。
ルート: 各機能に対応するルートの設定（URLパスやHTTPメソッドなど）が含まれます。
ビュー: デフォルトのビューが指定されており、カスタマイズが可能です。
Devise.mappings[:user]を使用することで、DeviseがUserモデルに対してどのような設定や動作をするかを判断し、それ
に応じてテスト環境を構築することができます。

------------------------------------------------------------------------------------------------
Devise.mappings は、Devise で設定された複数のモデルの認証情報のマッピング情報を格納するハッシュです。
[:user] は、Userモデルを認証に使用していることを示すために使われます。
Devise.mappings[:user] を使用することで、User モデルの認証に関する情報を取得することができます。例えば、
@request.env['devise.mapping'] のように使用することで、User モデルの認証に必要な情報を取得して、認証処理を行
うことができます。

------------------------------------------------------------------------------------------------
sign_in user

spec/rails_helper.rbに下記設定をする事により、sign_inを含むDeviseのヘルパーメソッドにアクセスすることができま
す。これにより、テスト内でユーザーをサインインさせることができるので、認証を必要とするアクションをテストすることがで
きます。
config.include Devise::Test::ControllerHelpers, type: :controller
=end
